## Plan Result (demo-cftapps_cluster_lb_backend)




<pre><code>Plan: 0 to add, 3 to change, 0 to destroy.</code></pre>

* Update
  * module.app-gw.azurerm_application_gateway.ag[1]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.app-gw.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw"

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.app-gw.azurerm_application_gateway.ag[1] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw"
        name                = "aks01-demo-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "demo"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
            id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/fis-fis-bulk-scan-api"
          ~ name         = "fis-fis-bulk-scan-api" -> "fis-bulk-scan-api"
            # (2 unchanged attributes hidden)
        }
      ~ backend_address_pool {
            id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/fis-fis-cos-api"
          ~ name         = "fis-fis-cos-api" -> "fis-cos-api"
            # (2 unchanged attributes hidden)
        }

      ~ backend_http_settings {
            id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/fis-fis-bulk-scan-api"
          ~ name                                = "fis-fis-bulk-scan-api" -> "fis-bulk-scan-api"
          ~ probe_name                          = "fis-fis-bulk-scan-api" -> "fis-bulk-scan-api"
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/fis-fis-cos-api"
          ~ name                                = "fis-fis-cos-api" -> "fis-cos-api"
          ~ probe_name                          = "fis-fis-cos-api" -> "fis-cos-api"
            # (7 unchanged attributes hidden)
        }




      ~ http_listener {
          ~ host_name                      = "fis-fis-bulk-scan-api-demo.service.core-compute-demo.internal" -> "fis-bulk-scan-api-demo.service.core-compute-demo.internal"
            id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/fis-fis-bulk-scan-api"
          ~ name                           = "fis-fis-bulk-scan-api" -> "fis-bulk-scan-api"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          ~ host_name                      = "fis-fis-cos-api-demo.service.core-compute-demo.internal" -> "fis-cos-api-demo.service.core-compute-demo.internal"
            id                             = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/fis-fis-cos-api"
          ~ name                           = "fis-fis-cos-api" -> "fis-cos-api"
            # (7 unchanged attributes hidden)
        }


      ~ probe {
          ~ host                                      = "fis-fis-bulk-scan-api-demo.service.core-compute-demo.internal" -> "fis-bulk-scan-api-demo.service.core-compute-demo.internal"
            id                                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/probes/fis-fis-bulk-scan-api"
          ~ name                                      = "fis-fis-bulk-scan-api" -> "fis-bulk-scan-api"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
      ~ probe {
          ~ host                                      = "fis-fis-cos-api-demo.service.core-compute-demo.internal" -> "fis-cos-api-demo.service.core-compute-demo.internal"
            id                                        = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/probes/fis-fis-cos-api"
          ~ name                                      = "fis-fis-cos-api" -> "fis-cos-api"
            # (8 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/aac-ac-int-manage-case-assignment" -> null
          - backend_address_pool_name  = "aac-ac-int-manage-case-assignment" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/aac-ac-int-manage-case-assignment" -> null
          - backend_http_settings_name = "aac-ac-int-manage-case-assignment" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/aac-ac-int-manage-case-assignment" -> null
          - http_listener_name         = "aac-ac-int-manage-case-assignment" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/aac-ac-int-manage-case-assignment" -> null
          - name                       = "aac-ac-int-manage-case-assignment" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/aac-ac-int-manage-case-assignment"
          + backend_address_pool_name  = "aac-ac-int-manage-case-assignment"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/aac-ac-int-manage-case-assignment"
          + backend_http_settings_name = "aac-ac-int-manage-case-assignment"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/aac-ac-int-manage-case-assignment"
          + http_listener_name         = "aac-ac-int-manage-case-assignment"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/aac-ac-int-manage-case-assignment"
          + name                       = "aac-ac-int-manage-case-assignment"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/adoption-cos-api" -> null
          - backend_address_pool_name  = "adoption-cos-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/adoption-cos-api" -> null
          - backend_http_settings_name = "adoption-cos-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/adoption-cos-api" -> null
          - http_listener_name         = "adoption-cos-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/adoption-cos-api" -> null
          - name                       = "adoption-cos-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/adoption-cos-api"
          + backend_address_pool_name  = "adoption-cos-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/adoption-cos-api"
          + backend_http_settings_name = "adoption-cos-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/adoption-cos-api"
          + http_listener_name         = "adoption-cos-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/adoption-cos-api"
          + name                       = "adoption-cos-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/bar-api-int" -> null
          - backend_address_pool_name  = "bar-api-int" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/bar-api-int" -> null
          - backend_http_settings_name = "bar-api-int" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/bar-api-int" -> null
          - http_listener_name         = "bar-api-int" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/bar-api-int" -> null
          - name                       = "bar-api-int" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/bar-api-int"
          + backend_address_pool_name  = "bar-api-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/bar-api-int"
          + backend_http_settings_name = "bar-api-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/bar-api-int"
          + http_listener_name         = "bar-api-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/bar-api-int"
          + name                       = "bar-api-int"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/camunda-bpm" -> null
          - backend_address_pool_name  = "camunda-bpm" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/camunda-bpm" -> null
          - backend_http_settings_name = "camunda-bpm" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/camunda-bpm" -> null
          - http_listener_name         = "camunda-bpm" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/camunda-bpm" -> null
          - name                       = "camunda-bpm" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/camunda-bpm"
          + backend_address_pool_name  = "camunda-bpm"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/camunda-bpm"
          + backend_http_settings_name = "camunda-bpm"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/camunda-bpm"
          + http_listener_name         = "camunda-bpm"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/camunda-bpm"
          + name                       = "camunda-bpm"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/ccd-ac-int-data-store-api" -> null
          - backend_address_pool_name  = "ccd-ac-int-data-store-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/ccd-ac-int-data-store-api" -> null
          - backend_http_settings_name = "ccd-ac-int-data-store-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/ccd-ac-int-data-store-api" -> null
          - http_listener_name         = "ccd-ac-int-data-store-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/ccd-ac-int-data-store-api" -> null
          - name                       = "ccd-ac-int-data-store-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/ccd-ac-int-data-store-api"
          + backend_address_pool_name  = "ccd-ac-int-data-store-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/ccd-ac-int-data-store-api"
          + backend_http_settings_name = "ccd-ac-int-data-store-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/ccd-ac-int-data-store-api"
          + http_listener_name         = "ccd-ac-int-data-store-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/ccd-ac-int-data-store-api"
          + name                       = "ccd-ac-int-data-store-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/ccd-ac-int-definition-store-api" -> null
          - backend_address_pool_name  = "ccd-ac-int-definition-store-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/ccd-ac-int-definition-store-api" -> null
          - backend_http_settings_name = "ccd-ac-int-definition-store-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/ccd-ac-int-definition-store-api" -> null
          - http_listener_name         = "ccd-ac-int-definition-store-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/ccd-ac-int-definition-store-api" -> null
          - name                       = "ccd-ac-int-definition-store-api" -> null
          - rule_type         

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/rd-profile-sync" -> null
          - http_listener_name         = "rd-profile-sync" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/rd-profile-sync" -> null
          - name                       = "rd-profile-sync" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/rd-profile-sync"
          + backend_address_pool_name  = "rd-profile-sync"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/rd-profile-sync"
          + backend_http_settings_name = "rd-profile-sync"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/rd-profile-sync"
          + http_listener_name         = "rd-profile-sync"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/rd-profile-sync"
          + name                       = "rd-profile-sync"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/rd-profile-sync-int" -> null
          - backend_address_pool_name  = "rd-profile-sync-int" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/rd-profile-sync-int" -> null
          - backend_http_settings_name = "rd-profile-sync-int" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/rd-profile-sync-int" -> null
          - http_listener_name         = "rd-profile-sync-int" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/rd-profile-sync-int" -> null
          - name                       = "rd-profile-sync-int" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/rd-profile-sync-int"
          + backend_address_pool_name  = "rd-profile-sync-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/rd-profile-sync-int"
          + backend_http_settings_name = "rd-profile-sync-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/rd-profile-sync-int"
          + http_listener_name         = "rd-profile-sync-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/rd-profile-sync-int"
          + name                       = "rd-profile-sync-int"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/rd-user-profile-api" -> null
          - backend_address_pool_name  = "rd-user-profile-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api" -> null
          - backend_http_settings_name = "rd-user-profile-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/rd-user-profile-api" -> null
          - http_listener_name         = "rd-user-profile-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/rd-user-profile-api" -> null
          - name                       = "rd-user-profile-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/rd-user-profile-api"
          + backend_address_pool_name  = "rd-user-profile-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api"
          + backend_http_settings_name = "rd-user-profile-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/rd-user-profile-api"
          + http_listener_name         = "rd-user-profile-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/rd-user-profile-api"
          + name                       = "rd-user-profile-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/rd-user-profile-api-int" -> null
          - backend_address_pool_name  = "rd-user-profile-api-int" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api-int" -> null
          - backend_http_settings_name = "rd-user-profile-api-int" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/rd-user-profile-api-int" -> null
          - http_listener_name         = "rd-user-profile-api-int" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/rd-user-profile-api-int" -> null
          - name                       = "rd-user-profile-api-int" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/rd-user-profile-api-int"
          + backend_address_pool_name  = "rd-user-profile-api-int"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/rd-user-profile-api-int"
          + backend_http_settings_name = "rd-user-profile-api-int"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/rd-user-profile-api-int"
          + http_listener_name         = "rd-user-profile-api-int"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/rd-user-profile-api-int"
          + name                       = "rd-user-profile-api-int"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/sscs-hearings-api" -> null
          - backend_address_pool_name  = "sscs-hearings-api" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/sscs-hearings-api" -> null
          - backend_http_settings_name = "sscs-hearings-api" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/sscs-hearings-api" -> null
          - http_listener_name         = "sscs-hearings-api" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/sscs-hearings-api" -> null
          - name                       = "sscs-hearings-api" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/sscs-hearings-api"
          + backend_address_pool_name  = "sscs-hearings-api"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/sscs-hearings-api"
          + backend_http_settings_name = "sscs-hearings-api"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/sscs-hearings-api"
          + http_listener_name         = "sscs-hearings-api"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/sscs-hearings-api"
          + name                       = "sscs-hearings-api"
          + rule_type                  = "Basic"
        }
      - request_routing_rule {
          - backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/ts-translation-service" -> null
          - backend_address_pool_name  = "ts-translation-service" -> null
          - backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/ts-translation-service" -> null
          - backend_http_settings_name = "ts-translation-service" -> null
          - http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/ts-translation-service" -> null
          - http_listener_name         = "ts-translation-service" -> null
          - id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/ts-translation-service" -> null
          - name                       = "ts-translation-service" -> null
          - rule_type                  = "Basic" -> null
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendAddressPools/ts-translation-service"
          + backend_address_pool_name  = "ts-translation-service"
          + backend_http_settings_id   = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/backendHttpSettingsCollection/ts-translation-service"
          + backend_http_settings_name = "ts-translation-service"
          + http_listener_id           = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/httpListeners/ts-translation-service"
          + http_listener_name         = "ts-translation-service"
          + id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw/requestRoutingRules/ts-translation-service"
          + name                       = "ts-translation-service"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-bulk-scan-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-bulk-scan-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-bulk-scan-api"
          + id                         = (known after apply)
          + name                       = "fis-bulk-scan-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "fis-cos-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "fis-cos-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "fis-cos-api"
          + id                         = (known after apply)
          + name                       = "fis-cos-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }



        # (170 unchanged blocks hidden)
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks00-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.app-gw.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
        id                         = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/applicationGateways/aks01-demo-agw|AppGw"
        name                       = "AppGw"
        # (2 unchanged attributes hidden)

      - log {
          - category = "ApplicationGatewayAccessLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayFirewallLog" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
      - log {
          - category = "ApplicationGatewayPerformanceLog" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = true -> null
            }
        }
      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1301,"Program":"tfcmt","SHA1":"","Target":"demo-cftapps_cluster_lb_backend","Vars":{}} -->